In [ ]:
# SQL Joins

In [2]:
### Import packages 
import sqlite3
import pandas as pd

In [40]:
### Connect to databases cats.db, dogs.db and owners.db using sqlite3 (use for example conn = sqlite3.connect('cats.db') and then c = conn.cursor())

conn = sqlite3.connect('cats.db') 
c = conn.cursor()
conn = sqlite3.connect('cats.db')
c = conn.cursor()
c.execute('ATTACH DATABASE "dogs.db" AS db_dogs')
c.execute('ATTACH DATABASE "owners.db" AS db_owners')
c.execute('''select * from cats;''').fetchall()

[('Bell', 'Siamese', '1', '4'),
 ('Jackson', 'Balinese', '2', '3'),
 ('Precious', 'Himalayan', '3', '4'),
 ('Rocky', 'Egyptian Mau', '4', '2'),
 ('Samson', 'Javanese', '5', '1'),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', None)]

In [35]:
c.description

(('Name', None, None, None, None, None, None),
 ('Breed', None, None, None, None, None, None),
 ('House_Number', None, None, None, None, None, None),
 ('Owner_ID', None, None, None, None, None, None))

In [16]:
c.execute('''select * from cats where breed LIKE 'S%';''').fetchall()

[('Bell', 'Siamese', '1', '4')]

In [23]:
c.execute('''select * from cats where substr(breed,0,2) = 'S';''').fetchall()

[('Bell', 'Siamese', '1', '4')]

In [22]:
c.execute('''select * from cats where substr(breed,0,3) = 'Si';''').fetchall()

[('Bell', 'Siamese', '1', '4')]

In [28]:
c.execute('''select * from cats where house_number !=2 and house_number != 4;''').fetchall()

[('Bell', 'Siamese', '1', '4'),
 ('Precious', 'Himalayan', '3', '4'),
 ('Samson', 'Javanese', '5', '1'),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', ''),
 ('', '', '', None)]

In [31]:
c.execute('''select * from cats where substr(breed,0,2) = 'S' and house_number not in (2,4);''').fetchall()

[('Bell', 'Siamese', '1', '4')]

In [30]:
c.execute('''select * from cats where house_number >1;''').fetchall()

[('Jackson', 'Balinese', '2', '3'),
 ('Precious', 'Himalayan', '3', '4'),
 ('Rocky', 'Egyptian Mau', '4', '2'),
 ('Samson', 'Javanese', '5', '1')]

In [38]:
c.execute('''select house_number, count(*) as cats2vac from cats where substr(breed,0,2) = 'S' group by house_number;''').fetchall()

[('1', 1)]

In [43]:
c.execute('''select house_number, count(*) as numcats from cats group by house_number order by numcats desc;''').fetchall()

[('', 16), ('1', 1), ('2', 1), ('3', 1), ('4', 1), ('5', 1)]

In [44]:
c.execute('''select house_number, count(*) as numdogs from dogs group by house_number order by numdogs desc;''').fetchall()

[('1', 2), ('2', 2), ('3', 1), ('4', 1)]

In [55]:
c.execute('''with cats_num as (select house_number, count(*) as numcats from cats group by house_number order by numcats desc),
dogs_num as (select house_number, count(*) as numdogs from dogs group by house_number order by numdogs desc)
select cats_num.house_number, coalesce(cast(numcats as decimal)/ cast(numcats + numdogs as decimal),0) as cats_ratio
from cats_num
left join dogs_num on cats_num.house_number = dogs_num.house_number
order by cats_ratio desc;''')

In [56]:
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

  house_number  cats_ratio
0                        0
1            1           0
2            2           0
3            3           0
4            4           0

In [63]:
c.execute('''select * from cats left join owners on owners.id = cats.owner_id''').fetchall()

[('Bell', 'Siamese', '1', '4', 'Justin Bieber', '4103810987', 'None', '4'),
 ('Jackson',
  'Balinese',
  '2',
  '3',
  'Avi Flombaum',
  '4698780125',
  '1776 New York Ave',
  '3'),
 ('Precious',
  'Himalayan',
  '3',
  '4',
  'Justin Bieber',
  '4103810987',
  'None',
  '4'),
 ('Rocky',
  'Egyptian Mau',
  '4',
  '2',
  'Alison Peebles Madigan',
  '2147098190',
  'None',
  '2'),
 ('Samson',
  'Javanese',
  '5',
  '1',
  'Josh Daniell',
  '3132879573',
  '1440 G st.',
  '1'),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', '', None, None, None, None),
 ('', '', '', None, None, None, None, None)]

In [64]:
c.execute('''select * from cats inner join owners on owners.id = cats.owner_id''').fetchall()

[('Bell', 'Siamese', '1', '4', 'Justin Bieber', '4103810987', 'None', '4'),
 ('Jackson',
  'Balinese',
  '2',
  '3',
  'Avi Flombaum',
  '4698780125',
  '1776 New York Ave',
  '3'),
 ('Precious',
  'Himalayan',
  '3',
  '4',
  'Justin Bieber',
  '4103810987',
  'None',
  '4'),
 ('Rocky',
  'Egyptian Mau',
  '4',
  '2',
  'Alison Peebles Madigan',
  '2147098190',
  'None',
  '2'),
 ('Samson',
  'Javanese',
  '5',
  '1',
  'Josh Daniell',
  '3132879573',
  '1440 G st.',
  '1')]

In [67]:
c.execute('''select owners.name, cats.name as cat_name from cats left join owners on owners.id = cats.owner_id where owners.name is null''').fetchall()

[(None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, ''),
 (None, '')]

In [ ]:
Let's try and work through some exercises to recap and retain the foundational knowledge of the language that our beloved databases use.

In the suburbs of Capitol Hill, there is a new pet daycare starting up that distributes pets among 4 houses.
Down below we have tables representing cats and dogs in the particular houses, and corresponding owners. 

Cats Table:

Name  			 | Breed 			| House_Number| Owner_ID|       
------------- | ------------- | ------------|---------
Bell  			| Siamese			|		1	    | 4
Jackson  		| Balinese 		|       2     |3
Precious  	| Himalayan  		|         3    | 4
Rocky			| Egyptian Mau 	| 4 		    | 2
Samson			| Javanese		|	4		| 1

Dogs Table:

Name  			 | Breed 	| House_Number	|Owner_ID|
-------------| ------------- | ------------|-----   
Rex  			| Chihuahua  		|		1	    |3
Clifford  	| German Shepherd|     2        |2
Lucky  		| Daschund  		|     3        |1
Bobo			| Shih-Tzu		|    2		   | 4
Buddy			| Golden Retriever | 4		   | 2
Leo				| English Bulldog | 1 | 2

Owners Table:

Name  		| Phone	| Address	|ID| 
-------------| ------------- | ------------|-----
Josh Daniell  | 313-287-9573  |1440 G St. |1
Alison Peebles Madigan| 214-709-8190| None |2
Avi Flombaum	| 469-878-0125  |  1776 New York Ave| 3
Justin Bieber | 410-381-0987 | None | 4


Write the appropriate SQL queries to satisfy the following prompts:

A. Write a SQL query that can grab the names of all pets owned by the founder of Flatiron School, Avi Flombaum

In [ ]:
B. Which House_Number contains the most number of pets in it and how many?

C. The daycare realized that House 4 needs the owners of its pets to update their addresses. Grab the names and phone numbers of owners with pets in house 4 that do not currently have an address.

In [ ]:
select * from pick;
select date, outboundprocess, spi, rank() over (partition by grouping order by spi desc) from 
(select *, 1 as grouping from pick) as pick_w_group;